const errata_zh={
    // 'DN/DN24.htm':[
    //     ['<!1>\n',''],
    // ],
    // 'DN/DN16.htm':[
    //     [/\((\d+)\)\[[SDNMEA\/\d\.]+\]\n/g,'($1)\n',9], //如 (145)[SA.498]
    //     [/\((\d+)\)\n/g, (m,m1)=>"\n<!"+(parseInt(m1)+1)+">\n",110], //缺少 <!數字>
    //     ['<!241>\n',''],// 是DN17
    // ],
    // 'DN/DN18.htm':[        ['<!273>\n',''],    ],

    'DN/DN06.htm':[['有道、有道跡。」(375)','有道、有道跡。」']],
    'DN/DN10.htm':[[/\(([\-\d]+) \)/g,'($1)',9],
        ['(457-458)','(458)' ],
        ['建立起面前的念後</a>，','建立起面前的念後</a>，(457)\n<br>　　' ],
        ['(464-465)','(465)'],
        ['如曠野道路；','如曠野道路；(464)\n<br>　　'],
    ],
    'DN/DN11.htm':[['[譯者按：此指DN.2「更勝妙的沙門果」段落]','']],
    'DN/DN13.htm':[
        ['襪謝德！三明婆羅門們被這五蓋覆蓋','(548)\n<br>　　襪謝德！三明婆羅門們被這五蓋覆蓋'],
        ['(548-549)','(549)']
    ],
    'DN/DN14.htm':[[/。 』/g,'。』',3]],
    'DN/DN16.htm':[
        ['(154)[Ud.76]','(154)'],
        [/\[[ASDM][^\]]+\]/g,'',26]
    ],
    'DN/DN17.htm':[
        [/\[[ASDM][^\]]+\]/g,'',2],
        
        ['阿難！那時，輪寶征服大海周邊土地後','(244)\n<br>　　阿難！那時，輪寶征服大海周邊土地後'],
        ['(244-245)','(245)'],
        ['阿難！那時，大善見王這麼想：『讓我在這些蓮花池岸上設置男子的沐浴處',
        '(253)\n<br>　　阿難！那時，大善見王這麼想：『讓我在這些蓮花池岸上設置男子的沐浴處'],
        ['(253-254)','(254)'],
        ['阿難！達摩宮殿被兩道鈴噹網包圍環繞','(257)\n<br>　　阿難！達摩宮殿被兩道鈴噹網包圍環繞'],
        ['(257-258)','(258)'],
        ['登上達摩宮殿。(259)','登上達摩宮殿。'],
        ['<br>到達禪','(259)\n<br>到達禪'],
        ['(260-261)','(261)'],
        ['阿難！那時，大善見王進入大陣列重閣後','(260)\n<br>　　阿難！那時，大善見王進入大陣列重閣後'],
        ['阿難！而那些八萬四千城市','(270)\n<br>　　阿難！而那些八萬四千城市'],
        ['(270-271)','(271)'],
    ],
    'DN/DN33.htm':[['"note(this,850)">無十之事</a>','"note(this,850);">無十之事</a>']], //missing ;

    'MN/MN001.htm':[['那些比丘回答世尊。(1)\n<br>　　世尊這麼說：','那些比丘回答世尊。\n<br>　　世尊這麼說：(1)']],
    'MN/MN010.htm':[['<br>　　世尊這麼說：','<br>　　世尊這麼說：(105)']],
    'MN/MN021.htm':[['"note(this,8776;">分</a>','"note(this,8776);">分</a>']], //missing )

    'MN/MN036.htm':[['從座位起來後離開。','從座位起來後離開。(389)']],
    'MN/MN048.htm':[['(491)','']],
    'MN/MN054.htm':[['\n <br>　　','\n<br>　　']],
    'MN/MN085.htm':[
        // ['<br>　　當這麼說時，散若葛之子學生婆羅門對菩提王子這麼說：',
            // '<!346>\n<br>　　當這麼說時，散若葛之子學生婆羅門對菩提王子這麼說：'],//只差一個 補上
    ],
    'MN/MN086.htm':[[/<br>\n<br>　　附註：菩提比丘.+?\n/,'']],

    'MN/MN145.htm':[['(366)','(396)']],
    'MN/MN101.htm':[
        // ['『尼乾陀道友們！像這樣，你們確實不知道：「我們以前存在；非不存在。」',
        // '\n<!2>『尼乾陀道友們！像這樣，你們確實不知道：「我們以前存在；非不存在。」'],
        // ['<br>　　尼乾陀道友們！猶如男子如果被塗有','<!3>\n<br>　　尼乾陀道友們！猶如男子如果被塗有'],
        // ['<br>　　比丘們！當這麼說時，那些尼乾陀們對我這麼說：','<!4>\n<br>　　比丘們！當這麼說時，那些尼乾陀們對我這麼說：'],
        // ['<br>　　比丘們！當這麼說時，我對那些尼乾陀們這麼說：','<!5>\n<br>　　比丘們！當這麼說時，我對那些尼乾陀們這麼說：'],
        // ['<br>　　「尼乾陀道友們！像這樣，當你們有激烈行動','<!6>\n<br>　　「尼乾陀道友們！像這樣，當你們有激烈行動'],
        // ['<br>　　再者，比丘們！我對那些尼乾陀們這麼說：\n<br>　　『尼乾陀道友們！你們怎麼想：這裡',
        // '<!7>\n<br>　　再者，比丘們！我對那些尼乾陀們這麼說：\n<br>　　『尼乾陀道友們！你們怎麼想：這裡'],
        // ['<br>　　『尼乾陀道友們！像這樣，這裡，凡在當生中應該被感受的業',
        // '<!8>\n<br>　　『尼乾陀道友們！像這樣，這裡，凡在當生中應該被感受的業'],
        // ['<br>　　比丘們！如果眾生因以前所作而感受苦樂，比丘們！尼乾陀們以前確實作了惡業者',
        // '<!9>\n<br>　　比丘們！如果眾生因以前所作而感受苦樂，比丘們！尼乾陀們以前確實作了惡業者'],
        // ['<br>　　而，比丘們！如何是行動有結果的','<!10>\n<br>　　而，比丘們！如何是行動有結果的'],
        // ['<br>　　比丘們！猶如男子對女子','<!11>\n<br>　　比丘們！猶如男子對女子'],
        // ['<br>　　再者，比丘們！比丘像這樣深慮','<!12>\n<br>　　再者，比丘們！比丘像這樣深慮'],
    ],
    // 'MN/MN105.htm':[['<br>　　「善星！凡那些比丘在我面前記說完全智',
            // '<!56>\n<br>　　「善星！凡那些比丘在我面前記說完全智']],
    // 'MN/MN109.htm':[['<!87>\n<br>　　「大德！什麼','<!88>\n<br>　　「大德！什麼'],],
    // 'MN/MN111.htm':[['<br>　　比丘們！當正確地說時','<!97>\n<br>　　比丘們！當正確地說時']],
    // 'MN/MN114.htm':[['<!109>','']],//redundant
    // 'MN/MN116.htm':[
    //     ['<br>　　「比丘們！名叫無害','<!134>\n<br>　　「比丘們！名叫無害'],
    //     ['<br>　　「這些無苦惱','<!135>\n<br>　　「這些無苦惱'],
    //     [/<br>\n<br>　　附：下為以上辟支佛的譯名與原文的對照：\n<br>　　無害.+?\n/,'']
    // ],
    'MN/MN133.htm':[
        ['』大德！當這麼說時','』\n<br>　　大德！當這麼說時',3],
        ['：『應該不隨','：\n<br>　　『應該不隨',3],
        ['，凡過去的','，\n<br>　　凡過去的',3],
        ['。凡現在已生起','。\n<br>　　凡現在已生起',3],
        ['，不能被征服','，\n<br>　　不能被征服',3],
        ['。只有今','。\n<br>　　只有今',3],
        ['？因為與死','？\n<br>　　因為與死',3],
        ['。這樣熱心','。\n<br>　　這樣熱心',3],
        ['，寂靜的','，\n<br>　　寂靜的',3],
    ],
    'MN/MN139.htm':[['。『凡','。\n<br>　　『凡',3]],
    'MN/MN149.htm':[
        ['不貪著。如果對它住於不執著','不貪著。\n<br>　　如果對它住於不執著'],
        ['像這樣，這八支聖道到達圓滿的修習。當他這麼修習這八支聖道時，',
        '像這樣，這八支聖道到達圓滿的修習。\n<br>　　當他這麼修習這八支聖道時，'],
        ['修習。他的這二法雙連轉起了','修習。\n<br>　　他的這二法雙連轉起了'],
        [/。比丘們！/g,'。\n<br>　　比丘們！',4]],
    'SN/SN0246.htm':[
        [/<br>　　附註：菩提比丘.+/,''],//缺少標號的附註，先移除
    ],
    'SN/SN0345.htm':[
        [/<br><span class="sutra_name">相應部12相應83\-93經\/學經等.+/,'\n^h[學經]'],//一檔只能有一個 span sutra_name
    ],
    'SN/SN0374.htm':[[/\(\d\)/g,'',5]], //非段號
    'SN/SN0375.htm':[[/\(\d\)/g,'',4]],
    'SN/SN0376.htm':[[/\(\d\)/g,'',3]],
    'SN/SN0377.htm':[[/\(\d\)/g,'',2]],
    'SN/SN0700.htm':[//182-191被合併為一檔，補標記
        ['<br>　　羅陀！凡為魔法者'   ,'^n183 羅陀！凡為魔法者'],
        ['<br>　　「羅陀！凡為無常者'  ,'^n184 「羅陀！凡為無常者'],
        ['<br>　　「羅陀！凡為無常法'  ,'^n185 「羅陀！凡為無常法'],
        ['<br>　　「羅陀！凡為苦者'    ,'^n186 「羅陀！凡為苦者'],
        ['<br>　　「羅陀！凡為苦法者'  ,'^n187 「羅陀！凡為苦法者'],
        ['<br>　　「羅陀！凡為無我者'  ,'^n188 「羅陀！凡為無我者'],
        ['<br>　　「羅陀！凡為無我法者','^n189 「羅陀！凡為無我法者'],
        [/<br>　　「羅陀！凡為(<[^>]+>)滅盡/,'^n190 「羅陀！凡為$1滅盡'],
        [/<br>　　「羅陀！凡為(<[^>]+>)消散法/,'^n191 「羅陀！凡為$消散法'],
        [/<br>　　「羅陀！凡為(<[^>]+>)集法/,'^n192 「羅陀！凡為$集法'],
    ],
    'SN/SN0702.htm':[//194-204 合併一檔
        ['<br>　　「羅陀！凡為魔法者'   ,'^n195 羅陀！凡為魔法者'],
        ['<br>　　「羅陀！凡為無常者'  ,'^n196 「羅陀！凡為無常者'],
        ['<br>　　「羅陀！凡為無常法'  ,'^n197 「羅陀！凡為無常法'],
        ['<br>　　「羅陀！凡為苦者'    ,'^n198 「羅陀！凡為苦者'],
        ['<br>　　「羅陀！凡為苦法者'  ,'^n199 「羅陀！凡為苦法者'],
        ['<br>　　「羅陀！凡為無我者'  ,'^n200 「羅陀！凡為無我者'],
        ['<br>　　「羅陀！凡為無我法者','^n201 「羅陀！凡為無我法者'],
        [/<br>　　「羅陀！凡為(<[^>]+>)滅盡/,'^n202 「羅陀！凡為$1滅盡'],
        [/<br>　　「羅陀！凡為(<[^>]+>)消散法/,'^n203 「羅陀！凡為$消散法'],
        [/<br>　　「羅陀！凡為(<[^>]+>)集法/,'^n204 「羅陀！凡為$集法'],
    ],
    'SN/SN0723.htm':[
        // 移到前一行，既非存在也非不存在經] 是 241(十七經) 的標題，而不是前品十八經
        [/<span class="sutra_name">(.+?)\n<br>　*(.+?)應該如前品十八經解說使之詳細\)\n/,
         '<br>^n225-240 $2應該如前品十八經解說使之詳細)\n<span class="sutra_name">$1\n'],
        ['<br>　　起源於舍衛城。','^n241 起源於舍衛城。']
    ],
    'SN/SN0733.htm':[//以723同樣情況
        [/<span class="sutra_name">(.+?)\n<br>　*(.+?)應該如第二品二十四經解說使之完成\)\n/,
         '<br>^n251-274 $2應該如第二品二十四經解說使之完成)\n<span class="sutra_name">$1\n'],
        ['<br>　　起源於舍衛城。','^n275 起源於舍衛城。']
    ],
    'SN/SN0735.htm':[  
        [/<span class="sutra_name">(.+?)\n<br>　*(.+?)應該如第二品二十四經解說使之完成\)\n/,
         '<br>^n277-300 $2應該如第二品二十四經解說使之完成)\n<span class="sutra_name">$1\n'],
        ['<br>　　起源於舍衛城。','^n301 起源於舍衛城。']
    ],
    'SN/SN0848.htm':[
        ['<br>　　有關於定的行境善巧',"^n$$ 有關於定的行境善巧",3,708], //counter from 708
    ],
    'SN/SN0849.htm':[
        ['<br>　　有關於定的決意善巧','^n$$ 有關於定的決意善巧',2,712], 
    ],
    'SN/SN0850.htm':[
        ['<br>　　他是關於定','^n715 他是關於定'],
    ],
    'SN/SN0884.htm':[
        ['<br>　　比丘們！一切都是','^n$$ 比丘們！一切都是',9,34],//老法,病法,死法,愁法,污染法,滅盡法,消散法,集法,滅法
    ],
    'SN/SN0885.htm':[
        ['<br>　　比丘們！一切都','^n$$ 比丘們！一切都',8,44], //是苦 是無我 應該被證知 應該被遍知 應該被捨斷 應該被作證 應該被以證知遍知 是困厄
    ],
    'SN/SN0904.htm':[
        [/<br>\n<br>　　※附記：關於「法」的定型句.+\n/,''],//缺少標號的同頁註，先移除
        [/<br>　　「被世尊善說的」.+\n/,''],
        [/<br>　　「直接可見的」.+\n/,''],
        [/<br>　　「即時的」.+\n/,''],
        [/<br>　　「請你來看的」.+\n/,''],
        [/<br>　　「能引導的」.+\n/,''],
        [/<br>　　「應該被智者各自經驗的」.+\n/,''],
    ],
    'SN/SN1221.htm':[[/<a ?\r?\n/,'<a ']],
    'SN/SN1137.htm':[[/<br>　　\[……「.+\n/,'']],//[學友們！這裡，當我獨處、獨坐時，心中生起了這樣的深思：] 譯者補入，原文無
    'SN/SN1138.htm':[[/<br>　　\[……「.+\n/,'']],
    'SN/SN1139.htm':[[/<br>　　\[……「.+\n/,'']],
    'SN/SN1140.htm':[[/<br>　　\[……「.+\n/,'']],
    'SN/SN1141.htm':[[/<br>　　\[……「.+\n/,'']],
    'SN/SN1142.htm':[[/<br>　　\[……「.+\n/,'']],
    'SN/SN1143.htm':[[/<br>　　\[……「.+\n/,'']],
    'SN/SN1144.htm':[[/<br>　　\[……「.+\n/,'']],
    'SN/SN1263.htm':[
        ['<br>　　比丘們！猶如','^n$$ 比丘們！猶如',4,105], //阿致羅筏底河 薩羅浮河 摩醯河 凡任何大河
    ],
    'SN/SN1265.htm':[
        ['<br>　　比丘們！猶如','^n$$ 比丘們！猶如',4,111],//阿致羅筏底河 薩羅浮河 摩醯河 凡任何大河
    ],
    'SN/SN1267.htm':[
        ['<br>　　比丘們！猶如','^n$$ 比丘們！猶如',4,117],//阿致羅筏底河 薩羅浮河 摩醯河 凡任何大河
    ],
    'SN/SN1276.htm':[
        ['<br>　　「比丘們！猶如','^n$$ 「比丘們！猶如凡任何香根',4,142],//香根 香樹心 香花 小王
    ],
    'SN/SN1277.htm':[
        [/<br>　　「比丘們！猶如晴朗無雲/,'^n147 「比丘們！猶如晴朗無雲'],
        [/<br>　　「比丘們！猶如凡任何編織衣服/,'^n148 「比丘們！猶如凡任何編織衣服'],
    ],
    'SN/SN1393.htm':[['[再一個恒河中略品]','']],//redudant
    'SN/SN1394.htm':[['[再一個不放逸品]','']],//redudant
    'SN/SN1395.htm':[['[再一個力量所作品]','']],//redudant
    'SN/SN1406.htm':[['<!164>\n','']],//wrong markup , may be copy from other translation
    // 'SN/SN1524.htm':[['<span class="sutra_name">相應部48相應 83-114經</span>',
            // '<br><span class="sutra_name">相應部48相應 83-114經/省略</span>']]

    'AN/AN0081.htm':[['9.放逸等品\n','']],
    'AN/AN0082.htm':[['<span class="sutra_name">','9.放逸等品\n<span class="sutra_name">']],
    'AN/AN0940.htm':[['onMouseover="lnote(this','onMouseover="note(this']],
    'AN/AN0983.htm':[
        ['<br>\n<font color="#525000">\n<br>附錄：\n',''],
        [/<br><span class="sutra_name">摩訶僧祇律.+\n/,''],
        [/<br>　　病人成就五法.+\n/g,'',2],
    ],
    'AN/AN0984.htm':[
        ['<br>\n<font color="#525000">\n<br>附錄：\n',''],
        [/<br><span class="sutra_name">摩訶僧祇律.+\n/,''],
        [/<br>　　五法成就.+\n/g,'',2],
    ],
    'AN/AN0132.htm':[  ['<br>　　188.',''], [/<br>　　(1[89]\d)./g,'^n$1 ',9]], //connect with leading ^n
    'AN/AN0133.htm':[ ['<br>　　198.',''],  [/<br>　　([12]\d\d)./g,'^n$1 ',10]], 
    'AN/AN0134.htm':[ ['<br>　　209.',''],  [/<br>　　(21\d)./g,'^n$1 ',9]], 
    'AN/AN0135.htm':[ ['<br>　　219.',''],  [/<br>　　(2[23]\d)./g,'^n$1 ',15]],
    'AN/AN0136.htm':[ ['<br>　　235.',''],  [/<br>　　(2[34]\d)./g,'^n$1 ',12]],
    'AN/AN0137.htm':[ ['<br>　　248.',''],  [/<br>　　(2[45]\d)./g,'^n$1 ',9]],
    'AN/AN0138.htm':[ ['<br>　　258.',''],  [/<br>　　(2[56]\d)./g,'^n$1 ',9]],
    'AN/AN0212.htm':[ ['<br>　　382.',''],  [/<br>　　 *(\d+\-\d+)./g,'^n$1 ',2]],
    'AN/AN0214.htm':[ ['<br>　　398-401.',''],[/<br>　　 *(\d+\-\d+)./g,'^n$1 ',4]],
    'AN/AN0217.htm':[ ['<br>　　443-452.',''],[/<br>　　 *(\d+\-\d+)./g,'^n$1 ',5]],
    'AN/AN0228.htm':[ ['<br>　　600.',''],[/<br>　　 (\d+)./g,'^n$1 ',11]],
    'AN/AN0781.htm':[
        ['<br>\n<br>　　附註：\n',''],[/<br>　　「十八愛行」的內容.+\n/,''],
        [/<br>　　\(\d+\).+\n/g,'',18]
    ],
    'AN/AN1303.htm':[[/<br>　　\[.+\n/,'']],//[有一次，世尊住在舍衛城祇樹林給孤獨園。] 譯者補入，原文無

    'AN/AN1475.htm':[[/<br>\n<br>　　按：.+\n/,'']],
    'AN/AN1527.htm':[['<span class="sutra_name">增支部9集74-81經</span>(莊春江譯)\n<br>　　74-81.(應該像念住品那樣以正勤使之詳細)'
    ,'^n74-81 (應該像念住品那樣以正勤使之詳細)']],
    'AN/AN1529.htm':[['<span class="sutra_name">增支部9集84-91經</span>(莊春江譯)\n<br>　　84-91.(應該如念住品那樣以神足使之詳細)'
    ,'^n84-91 (應該如念住品那樣以神足使之詳細)']],

    'AN/AN1532.htm':[['<br><span class="sutra_name">增支部9集113-432經</span>(莊春江譯)\n<br>　　113-432. ','\n^n113-432 ']], //113-432 合併
    'AN/AN1722.htm':[['<br>　　200-209.',''],['<br>　　210.','^n210 ']],
    'AN/AN1737.htm':[['<br>　　225-228.',''],['<br>　　229-232.','^n229-232 '],['<br>　　233-236.','^n233-236 ']],
    'AN/AN1741.htm':[['<br>　　240-266.',''],['<br>　　267-746.','\n^n267-746 ']],
    'AN/AN1763.htm':[['<br>　　22-29.',''],
    ['<br>　　 30-69.','^n30-69 '],
    ['<br>　　 70-117.','^n70-117 '],
    ['<br>　　 118-165.','^n118-165 '],
    ['<br>　　 166-213.','^n166-213 '],
    ['<br>　　 214-261.','^n214-261 '],
    ['<br>　　 262-309.','^n262-309 '],
    ['<br>　　 310-357.','^n310-357 '],
    ['<br>　　 358-405.','^n358-405 '],
    ['<br>　　 406-453.','^n406-453 '],
    ['<br>　　 454-501.','^n454-501 '],
    ],
    'AN/AN1764.htm':[
        //502 為空段, 之後號碼順延
        ['4.貪中略[品]','^n502 中略…\n\n4.貪中略'],
        ['<br>　　502.',''], //改為503
        ['<br>　　 503-511.','^n504-512'],
        ['<br>　　 512-671.','^n513-672'] ,

    ]
}
const errata_pli={

    'MN/MN051.htm':[['<br>　　 1. Gahapativaggo','^h[1. Gahapativaggo]']],//干擾breakMN
    "SN/SN0804.htm":[['Santi, bhikkhu','<br>　　 602.\nSanti, bhikkhu']],
    "SN/SN1393.htm":[['<br>　　 Punagaṅgānadī','<br>　　 312-323.\n<br>　　 Punagaṅgānadī']],
    "SN/SN1394.htm":[['<br>　　 Tathāgatādisuttaṃ','<br>　　 324-333.\n<br>　　 Tathāgatādisuttaṃ']],
    "SN/SN1395.htm":[['<br>　　 Punabalādisuttaṃ','<br>　　 334-345.\n<br>　　 Punabalādisuttaṃ']],
    "SN/SN1396.htm":[['<br>　　 Puna-esanādisuttaṃ','<br>　　 346-356.\n<br>　　 Puna-esanādisuttaṃ']],
    "SN/SN1397.htm":[ ['<br>　　 Puna-oghādisuttaṃ','<br>　　 357-366.\n<br>　　 Puna-oghādisuttaṃ']],
    "SN/SN1524.htm":[['<br>　　','<br>　　553-586.']],
    "SN/SN1527.htm":[['<br>　　','<br>　　609-640.']],
    "SN/SN1530.htm":[['<br>　　','<br>　　609-640.']],  //sn5 541-552 不能改為541-586
    "AN/AN0096.htm":[['<br>　　 \n96.','<br>　　 96.']],
    "AN/AN0129.htm":[['<br>　　 \n174.','<br>　　 174.']],
    "AN/AN0162.htm":[['<br>　　 \n297.','<br>　　 297.']],
    "AN/AN0203.htm":[['<br>　　 \n342-344.','<br>　　 342-344.']],
    'AN/AN0358.htm':[[/130\. “/,'<br>　　 130.“']],
    'AN/AN0688.htm':[['<br>(Chaṭṭhaṃ','<br>　　 106.(Chaṭṭhaṃ']],
}
export {errata_zh,errata_pli};